---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsGbxmlOpeningType
source: html/68942fbd-2871-c3b9-2acd-5ac0f4e8e8f7.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsGbxmlOpeningType Property

"Opening Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsGbxmlOpeningType { get; }
```